<HTML>
<HEAD>
<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
<META NAME="Generator" CONTENT="Microsoft Word 97">
<TITLE>ExciteBike 68K</TITLE>
<META NAME="Template" CONTENT="C:\PROGRAM FILES\MICROSOFT OFFICE\OFFICE\html.dot">
</HEAD>
<BODY TEXT="#ffffff" LINK="#ffffff" VLINK="#ffffff" BACKGROUND="Screens/Background.jpg" alink="#FFFFFF">

<P></></P>
<FONT FACE="Treasure" SIZE=7 COLOR="#ffff00"><STRONG><P ALIGN="CENTER">- E x c i t e b i k e 6 8 k - </FONT></STRONG><FONT FACE="Arial" COLOR="#ffff00"><BR>
<BR></FONT>
-------------------------------------------------------------------------------------------------<BR>
-------------------------------------------------------------------------------------------------<BR>
-------------------------- <FONT FACE="Treasure" COLOR="#ffff00">Par Travis Fischer</FONT><FONT FACE="Arial" COLOR="#ffffff"> /Fisch\ --------------------------<BR>
---------------------------------- phishfud@elknet.net ----------------------------------<BR>
----------------------------------- 1<SUP>er</SUP> Mai 2004 -----------------------------------<BR>
-------------------------------------------------------------------------------------------------<BR>
-------------------------------------------------------------------------------------------------<BR>
<BR>
<STRONG>
<FONT COLOR="#ffcc00">
SOMMAIRE :
</FONT>
</STRONG><BR>
1) Introduction<BR>
2) Mat&eacute;riel requis<BR>
3) Instructions<BR>
4) Aide et conseils<BR>
5) Contenu<BR>
6) Cr&eacute;dits<BR>
7) Annonce<BR>
8) Images<BR>
<BR>
<BR>
=============<BR>
INTRODUCTION<BR>
=============</FONT><FONT FACE="Arial"><BR>
<BR>
Ce jeu est un clone du c&eacute;l&egrave;bre jeu sur NES (Console Nintendo 8-bits) Excitebike, un jeu de moto-cross. Les conditions de jeu dans Excitebike 68k sont exactement les m&ecirc;mes que l'original, ainsi que les cinq circuits pr&eacute;-programm&eacute;s. Ce programme a &eacute;t&eacute; cr&eacute;e avec la Ti-89, la Ti-89 Titanium, la Ti-92+, et la V200. Le m&ecirc;me programme devrait 'ex&eacute;cuter sur toutes ces calculatrices. Si besoin est, les informations sur les contr&ocirc;les sont inclus dans le jeu lui-m&ecirc;me depuis l'option "Informations", qui se trouve dans la cat&eacute;gorie "Options". Amusez-vous bien </FONT><FONT FACE="Wingdings">J</FONT><FONT FACE="Arial"> <BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">==============<BR>
MAT&Eacute;RIEL REQUIS<BR>
==============</FONT><FONT FACE="Arial"><BR>
<BR>
Envoyez les deux fichiers d'Excitebike 68k correspondant &agrave; votre calculatrice et tapez excitebk() &agrave; l'&eacute;cran HOME pour commencer le jeu. <BR>
Le programme est capable de d&eacute;tecter sur quel mod&egrave;le de calculatrice ce jeu s'ex&eacute;cute et le m&ecirc;me programme devrait s'ex&eacute;cuter sur les trois calculatrices. Assurez-vous que l'un des fichiers comporte un Z dans son extension (Fichier ASM pour la calculatrice) et que l'autre comporte un Y dans son extension (Fichier ppg pour la calculatrice).</P>
</FONT><FONT FACE="Arial" COLOR="#ffff00"><P ALIGN="CENTER">Si vous avez une TI-89 Titanium (ce dont je doute vu qu'on est en mai et qu'elle n'est pas encore sortie ^^) vous DEVEZ envoyer le fichier 89z appropri&eacute;. Ce lanceur est incompatible avec les autres calculatrices existant d&eacute;j&agrave;. Notez que ce programme n'a pas &eacute;t&eacute; test&eacute; sur une Ti-89 Titanium (et pour cause), mais cela devrait marcher en th&eacute;orie.<BR>
<BR>
<BR>
=============<BR>
INSTRUCTIONS<BR>
=============</FONT><FONT FACE="Arial"><BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">G&eacute;n&eacute;ral :<BR>
</FONT><FONT FACE="Arial">--------<BR>
<BR>
Faites la course contre un, deux ou trois Motards &agrave; Intelligence Artificielle, un ami, ou seul dans un des cinq circuits pr&eacute;-programm&eacute;s ou un circuit que vous aurez construit pour l'occasion. &Eacute;vitez les terrains hasardeux et envolez-vous dans les airs sur plus de vingt types de terrain. Chaque circuit a son propre record du tour et aussi un temps qualificatif n&eacute;cessaire pour que vous soyez qualifi&eacute; et ainsi continuer sur des courses plus difficiles. <BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">Touches par d&eacute;faut (Les m&ecirc;mes sur les trois calculatrices) :<BR>
</FONT><FONT FACE="Arial">---------------------------------------<BR>
Haut - D&eacute;place la moto vers le haut du circuit<BR>
Bas - D&eacute;place la moto vers le bas du circuit <BR>
Gauche - Fait reculer la moto vers la gauche<BR>
Droite - Fait d&eacute;placer la moto vers la droite<BR>
APPS - suspend le d&eacute;roulement du jeu<BR>
ESC - Quitte le jeu<BR>
Bas et droit - Dans les airs, cela ex&eacute;cutera une pirouette arri&egrave;re pour un bonus de temps !<BR>
Haut et gauche - Dans les airs, cela ex&eacute;cutera une pirouette avant pour un bonus de temps !<BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">Touches sp&eacute;cifiques :<BR>
</FONT><FONT FACE="Arial">Ti-89 / Ti-92+ / Ti-v200<BR>
-----------------------<BR>
2nd / F1 / Hand - Utilise le palier de vitesse le plus bas, mais aucun risque de surchauffe (Gaz)<BR>
Shift / F5 / F1 - Utilise le palier de vitesse le plus haut, mais risque de surchauffe (Gaaaaa[…]aaaz)<BR>
F5 / F4 / F3 - Touche du professeur, permet de quitter rapidement le jeu.<BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">Modes :<BR>
</FONT><FONT FACE="Arial">------<BR>
<BR>
1) Course - Choisissez ce mode pour courir dans un des cinq circuits pr&eacute;-programm&eacute;s. Si vous finissez dans les trois premiers, vous avancerez au prochain niveau jusqu'&agrave; ce que vous ne vous qualifiez plus. Vous pouvez choisir de charger un circuit externe et y courir dessus. <BR>
<BR>
2) Multijoueurs - Participez &agrave; une course contre un ami (ou un ennemi, &ccedil;a d&eacute;pend de son humeur ^^) via le Link Cable &trade; dans un combat mano-a-mano ! Regardez la section "Jeu en R&eacute;seau" de ce fichier pour plus d'informations sur le mode multijoueurs.<BR>
<BR>
3) &Eacute;diteur de circuits - Construisez et customisez vos propres circuits et faites la course dessus dans n'importe quel mode. Les options incluent la cr&eacute;ation, l'&eacute;dition et la suppression des circuits externes. Dans l'&eacute;diteur de circuits, le morceau de terrain s&eacute;lectionn&eacute; clignote. Pressez Gauche ou Droite fera bouger votre curseur dans la direction correspondante en haut de l'&eacute;cran. Appuyez sur la touche Turbo pour choisir le morceau de terrain et pour se d&eacute;placer sur le prochain morceau de circuit. Vous pouvez revenir en arri&egrave;re en appuyant sur la touche DEL. Cela n'affectera pas le terrain d&eacute;j&agrave; pos&eacute;. Soyez cr&eacute;atif en rendant vos circuits int&eacute;ressants.<BR>
NOTE - En mode Multijoueurs, seule la calculatrice h&ocirc;tesse (celle qui cr&eacute;e le jeu, c'est-&agrave;-dire la premi&egrave;re &agrave; rejoindre le jeu) doit avoir ce niveau si vous voulez courir dessus.<BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">Information sur les parties &agrave; deux joueurs<BR>
</FONT><FONT FACE="Arial">----------------<BR>
<BR>
Assurez-vous que les deux calculatrices poss&egrave;dent les fichiers Excitebite et que le c&acirc;ble de transmission est bien connect&eacute; &agrave; ces deux machines. S&eacute;lectionnez l'option "Multijoueurs" dans le menu principal. La calculatrice qui rejoint en premier le jeu deviendra l'h&ocirc;te, ce qui, &agrave; moins que vous ne soyez int&eacute;ress&eacute; &agrave; la source, importe peu. Le jeu en multijoueurs a &eacute;t&eacute; maintes fois test&eacute;, mais une connexion parfaite ne peut pas &ecirc;tre assur&eacute;e &agrave; 100%. Il y a une diff&eacute;rence notable de vitesse dans les jeux multijoueurs &agrave; cause des donn&eacute;es qui ont besoin d'&ecirc;tre transf&eacute;r&eacute;es &agrave; travers le c&acirc;ble, et ce fr&eacute;quemment. En cas d'erreur de transmission, recommencez juste l'op&eacute;ration. Cela pourra fonctionner &agrave; nouveau. Si une calculatrice se fige en attendant que l'autre veuille bien le rejoindre alors c'est d&eacute;j&agrave; fait, c'est qu'une calculatrice a d&eacute;j&agrave; s&eacute;lectionn&eacute; le mode multijoueurs alors que l'autre n'a pas encore ex&eacute;cute le programme. <B>Les deux calculatrices doivent ex&eacute;cuter le programme quand vous entrez dans le menu "Multijoueurs",</B> sinon cela ne fonctionnera pas. Cependant, ne croyez pas que vous devez exactement choisir l'option "Multijoueurs" en m&ecirc;me temps, du moment que l'on est en train de jouer &agrave; ExciteBike.<BR>
Il est tr&egrave;s amusant de jouer &agrave; ExciteBike avec un ami alors essayez-le, surtout avec les circuits que vous aurez vous-m&ecirc;me cr&eacute;&eacute;s ! <BR>
<BR>
NOTE - En mode Multijoueurs , seulement la calculatrice h&ocirc;tesse n&eacute;cessite le circuit sur lequel vous voulez vous mesurer.</P>
<P ALIGN="CENTER"><BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">Tricheries<BR>
</FONT><FONT FACE="Arial">-------<BR>
<BR>
Apr&egrave;s chaque course sur le cinqui&egrave;me circuit, si votre temps au tour est inf&eacute;rieur &agrave; 50 secondes avec aucun mode de triche activ&eacute;, un message sera affich&eacute;, vous indiquant un nouveau code. Vous pouvez entrer les codes dans le menu des options. Chaque fois que vous activez ou d&eacute;sactivez une option de triche, vous l'activerez, ou la d&eacute;sactiverez suivant le cas. Si le code est correct, un message sera affich&eacute; pour savoir quelle ruse vous aurez enclench&eacute;e. La triche est autoris&eacute;e dans n'importe quel mode de jeu, mais il vous sera impossible de d&eacute;bloquer de nouveaux codes si vous l'avez activ&eacute;e.<BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">==============<BR>
AIDE ET CONSEILS<BR>
==============</FONT><FONT FACE="Arial"><BR>
<BR>
Si vous trouvez quelque chose qui ne va pas dans le jeu, si vous savez comment am&eacute;liorer Excitebike, si vous parlez le franss&eacute; mieux que 240-185, ou si vous &ecirc;tes seul, sans ami et sans Tamagotchi :p votre adresse &eacute;lectronique est la bienvenue, sauf si vous envoyez du pourriel ou autre courrier ind&eacute;sirable. Si vous voulez r&eacute;utiliser une partie majeure de la source, contactez d'abord l'auteur.</P>
<P ALIGN="CENTER"> <BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">Conseils :<BR>
</FONT><FONT FACE="Arial">-----<BR>
<BR>
1) En appuyant sur Gauche ou Droite SUR la rampe, vous pouvez ais&eacute;ment changer le type de saut que vous effectuerez. Appuyer sur Gauche donnera un saut plus haut, et court, appuyer sur Droite donnera un saut plus long et plus bas.<BR>
<BR>
2) Faites des pirouettes arri&egrave;re sur les rampes qui ont la pente la plus haute. M&ecirc;me si vous &ecirc;tes en l'air plus longtemps, vous aurez moins de place pour finir votre pirouette. Il para&icirc;trait que les grandes bosses, les deux rampes monstres, et la grande bosse sont les morceaux de terrain les plus adapt&eacute;s pour ex&eacute;cuter des pirouettes. Les pirouettes arri&egrave;re sont g&eacute;niales et sont aussi la cl&eacute; pour se qualifier sur des courses plus difficiles. Vous gagnez trois pr&eacute;cieuses secondes en faisant une pirouette arri&egrave;re, alors faites la pirouette&nbsp;!<BR>
<BR>
3) En cas de doute pendant un saut, laissez voler votre moto. C'est une m&eacute;thode de course assez lente, mais cela facilitera l'atterrissage.<BR>
<BR>
4) Assurez-vous de pouvoir n&eacute;gocier chaque obstacle facilement et rapidement.<BR>
<BR>
5) Essayez d'&eacute;viter de vous m&ecirc;ler dans un groupe de concurrents qui vont &agrave; la m&ecirc;me vitesse que vous. Ils peuvent vous g&ecirc;ner. C'est la diff&eacute;rence entre la qualification et l'&eacute;limination.<BR>
<BR>
6) Quand vous cr&eacute;ez un circuit, essayez de m&eacute;langer des parties difficiles et faciles pour que le plaisir soit &agrave; la port&eacute;e de tous.<BR>
<BR>
7) Roulez sur les fl&egrave;ches aussi souvent que possible ; cela &eacute;vitera la surchauffe.<BR>
<BR>
8) Il vaut mieux m&eacute;moriser chaque circuit ! Savoir o&ugrave; se trouve une fl&egrave;che ou o&ugrave; ne pas sauter rapporte beaucoup.<BR>
<BR>
9) Comme dans l'original, matraquer les touches Gaz ou Turbo pendant que vous r&eacute;cup&eacute;rez votre moto apr&egrave;s un accident acc&eacute;l&eacute;rera la manœuvre et ainsi vous pourrez int&eacute;grer la course plus t&ocirc;t. <BR>
<BR>
10) Si vous voulez du challenge, alors privil&eacute;giez plusieurs motos &agrave; intelligence artificielle, bien que cela vous ralentira. Le processeur doit s'occuper de plusieurs motos en plus de la v&ocirc;tre. Vous ne pourriez donc pas finir une course aussi rapidement que vous voulez sans motos concurrentes. <BR>
<BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">==========<BR>
CONTENU<BR>
==========</FONT><FONT FACE="Arial"><BR>
<BR>
Jeu rapide *exactement* comme la version originale sur NES<BR>
Courses &agrave; deux joueurs<BR>
Design en pseudo-3D<BR>
Cinq circuits programm&eacute;s comme l'original<BR>
Graphismes en niveaux gris utilisant le double buffering<BR>
&Eacute;diteur de circuits simple d'acc&egrave;s<BR>
Possibilt&eacute; de r&eacute;aliser des pirouettes.<BR>
Compatible Ti-89/92+/v200 (Ti-89 Titanium incluse)<BR>
Codes de triche cach&eacute;s pouvant &ecirc;tre r&eacute;v&eacute;l&eacute;s<BR>
Informations sur le jeu incluses dans le programme<BR>
Ex&eacute;cution rapide et fluide sur HW1 et HW2<BR>
Possibilit&eacute; de r&eacute;gler le nombre de concurrents &agrave; intelligence artificielle (de z&eacute;ro &agrave; trois)<BR>
Code source en C abondamment comment&eacute;<BR>
<BR>
<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">========<BR>
CR&Eacute;DITS<BR>
========</FONT><FONT FACE="Arial"><BR>
<BR>
Ce programme a &eacute;t&eacute; &eacute;crit par Travis Fischer et a &eacute;t&eacute; traduit en fran&ccedil;ais par 240-185. Les graphismes et les circuits sont tous inspir&eacute;s &agrave; partir du jeu original "Excitebike" sur NES. Il y a un scrolling de cr&eacute;dits &agrave; l'option "Informations" dans la cat&eacute;gorie "Options". Travis Fischer se doit de remercier tous, vraiment tous, ceux qui participent au Programming Message Board &agrave; l'adresse suivante : </FONT><A HREF="http://pub26.ezboard.com/btichessteamhq">http://pub26.ezboard.com/btichessteamhq</A><FONT FACE="Arial">. Travis Fischer le visite souvent et obtient rapidement des r&eacute;ponses pertinentes et correctes &agrave; ses nombreuses questions. Si vous voulez apprendre le C avec TIGCC, vous devriez alors visiter fr&eacute;quemment ce forum (Attention, on &eacute;crit exclusivement en anglais). <BR>
Cependant, on trouvera aussi plein de passionn&eacute;s de TI sur </FONT><A HREF="http://www.yaronet.com/">http://www.yaronet.com</A><FONT FACE="Arial">. Attention, toutefois, la mentalit&eacute; g&eacute;n&eacute;rale diff&egrave;re avec les forums de la TiCT Team #trigni#. Si vous voulez discuter avec le traducteur de ce jeu, visitez alors </FONT><A HREF="http://pws.tigen.org/">http://pws.tigen.org</A><FONT FACE="Arial"> et vous pourrez ainsi discuter avec lui sur IRC :D.<BR>
<BR>
Remerciements &agrave; :<BR>
---------------------<BR>
<BR>
Thomas Nussbaumer<BR>
La TICT dans son ensemble<BR>
La Tigcc Team<BR>
Nintendo (NES)<BR>
Open Source<BR>
Malcolm Smith<BR>
Zeljko Juric<BR>
Kevin Kofler<BR>
Sebastian Reichelt<BR>
Lionel Debroux<BR>
TechnoPlaza<BR>
Clawsonia<BR>
240-185<BR>
Mathiniste<BR>
Kevin Kofler<BR>
Cisco, le chat de Travis :p<BR>
*et tous ceux qu'on aurait oubli&eacute; ^^<BR>
<BR>
B&ecirc;ta-Testeurs :<BR>
------------<BR>
Clawsonia<BR>
Angelboy<br>
Jordan Krage<br>
Kevin Kofler<br>
Geoffrey Anneheim<br>
AS<br>
240-185<br>
Travis Fischer, bien s&ucirc;r !<BR>
(Cisco n'a pas test&eacute; le jeu pour des raisons qui lui sont propres ^^)<BR>
<BR>
<BR>
===========<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">ANNONCE<BR>
</FONT><FONT FACE="Arial">===========<BR>
<BR>
Ce programme peut &ecirc;tre distribu&eacute; par n'importe qui pour un usage non-commercial. Vous &ecirc;tes libre de r&eacute;utiliser n'importe quelle partie du code source dans n'importe lequel de vos projets, du moment que lesdits projets ne sont PAS payants. Nous esp&eacute;rons que ce jeu puisse aider quelqu'un pour apprendre le C. Souvenez-vous juste de remercier l&agrave; o&ugrave; il faut &ecirc;tre remerci&eacute;. Ce jeu a &eacute;t&eacute; test&eacute; &agrave; plusieurs reprises mais dans le cas o&ugrave; il provoque des r&eacute;sultats peu attendus, ni Travis Fischer, ni 240-185 ne peuvent &ecirc;tre responsables de ce qui peut arriver. L'auteur ne garantit PAS l'int&eacute;grit&eacute; du programme qu'elle soit implicite ou non. Si vous trouvez des bugs, e-mailez &agrave; : <BR>
phishfud@elknet.net.<BR>
<BR>
<BR>
<BR>
<BR>
=========<BR>
</FONT><FONT FACE="Arial" COLOR="#ffff00">IMAGES<BR>
</FONT><FONT FACE="Arial">=========</P></FONT>
<P ALIGN="CENTER"><CENTER><TABLE BORDER CELLSPACING=1>
<TR><TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen2.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen3.bmp" WIDTH=160 HEIGHT=100></TD>
</TR>
<TR><TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen4.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen5.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen6.bmp" WIDTH=160 HEIGHT=100></TD>
</TR>
<TR><TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen7.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen8.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen9.bmp" WIDTH=160 HEIGHT=100></TD>
</TR>
<TR><TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen10.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen11.bmp" WIDTH=160 HEIGHT=100></TD>
<TD VALIGN="MIDDLE">
<P><IMG SRC="Screens/Screen12.bmp" WIDTH=160 HEIGHT=100></TD>
</TR>
</TABLE>
</CENTER></P>

<P ALIGN="CENTER"></P></BODY>
</HTML>
